src/cf/Documents/ОценкаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ОценкаСотрудников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СертификатыСотрудников</xr:Item>
				<xr:Item>AccumulationRegister.УчетВремениПоКомпетенциям</xr:Item>
				<xr:Item>InformationRegister.РезультатыОценкиСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРевью</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОценкиСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникиСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньЗнания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УровниЗнания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Оценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПолучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ГрадацииВремениПоКомпетенциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрадацииВремениПоКомпетенциям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеобходимоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Компетенция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УровеньЗнания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниЗнания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/УчетВремениПоКомпетенциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>УчетВремениПоКомпетенциям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Компетенция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РезультатыОценкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыОценкиСотрудников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УровеньЗнания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниЗнания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Оценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Компетенция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СертификатыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СертификатыСотрудников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ВидыОценкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыОценкиСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКомпетенции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКомпетенций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключаяСертификаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Компетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/ОценкаСотрудников/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ПроверяемыеРеквизиты.Добавить("ВидРевью");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПараметрыПроведения = Документы.ОценкаСотрудников.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыПроведения.Свойство("Реквизиты") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДокумента	= ПараметрыПроведения.Реквизиты;
	ОценкиТаблица		= ПараметрыПроведения.ВременнаяТаблицаОценки;
	СертификатыТаблица	= ПараметрыПроведения.ВременнаяТаблицаСертификаты;
	
	Если РеквизитыДокумента.ВидРевью = Справочники.ВидыОценкиСотрудников.ПервичнаяОценка Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОценкиТаблица", ОценкиТаблица);
		Запрос.Текст = "ВЫБРАТЬ
		|	ТЗ.Компетенция КАК Компетенция,
		|	ТЗ.УровеньЗнания КАК УровеньЗнания
		|ПОМЕСТИТЬ ВТОценкиТаблица
		|ИЗ
		|	&ОценкиТаблица КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрадацииВремениПоКомпетенциям.Компетенция,
		|	ГрадацииВремениПоКомпетенциям.УровеньЗнания,
		|	ГрадацииВремениПоКомпетенциям.НеобходимоЧасов
		|ИЗ
		|	РегистрСведений.ГрадацииВремениПоКомпетенциям КАК ГрадацииВремениПоКомпетенциям
		|ГДЕ
		|	(ГрадацииВремениПоКомпетенциям.Компетенция, ГрадацииВремениПоКомпетенциям.УровеньЗнания) В
		|		(ВЫБРАТЬ
		|			Компетенция,
		|			УровеньЗнания
		|		ИЗ
		|			ВТОценкиТаблица)";
		
		ВыгрузкаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
		
		Движения.УчетВремениПоКомпетенциям.Очистить();
		Для Каждого СтрокаОценки Из ОценкиТаблица Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Компетенция"	, СтрокаОценки.Компетенция);
			СтруктураОтбора.Вставить("УровеньЗнания", СтрокаОценки.УровеньЗнания);
			
			НайденныеСтроки = ВыгрузкаРезультатаЗапроса.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() Тогда
				НоваяЗапись = Движения.УчетВремениПоКомпетенциям.Добавить();
				НоваяЗапись.Период			= РеквизитыДокумента.Дата;
				НоваяЗапись.Регистратор		= РеквизитыДокумента.Ссылка;
				НоваяЗапись.Сотрудник		= СтрокаОценки.Сотрудник;
				НоваяЗапись.Компетенция		= СтрокаОценки.Компетенция;
				НоваяЗапись.Часов			= НайденныеСтроки[0].НеобходимоЧасов;
			КонецЕсли;
			
		КонецЦикла;
		Движения.УчетВремениПоКомпетенциям.Записывать = Истина;
		
	КонецЕсли;
	
	Движения.РезультатыОценкиСотрудников.Очистить();
	
	Для Каждого СтрокаОценки Из ОценкиТаблица Цикл
		
		НоваяЗапись = Движения.РезультатыОценкиСотрудников.Добавить();
		НоваяЗапись.Период			= РеквизитыДокумента.Дата;
		НоваяЗапись.Регистратор		= РеквизитыДокумента.Ссылка;
		НоваяЗапись.Сотрудник		= СтрокаОценки.Сотрудник;
		НоваяЗапись.Компетенция		= СтрокаОценки.Компетенция;
		НоваяЗапись.УровеньЗнания	= СтрокаОценки.УровеньЗнания;
		НоваяЗапись.Оценка			= СтрокаОценки.Оценка;
		
	КонецЦикла;
	
	Движения.РезультатыОценкиСотрудников.Записывать = Истина;
	
	Движения.СертификатыСотрудников.Очистить();
	Если РеквизитыДокумента.ВидРевью.ВключаяСертификаты Тогда
		
		Для Каждого СтрокаСертификата Из Сертификаты Цикл
			НоваяЗапись = Движения.СертификатыСотрудников.Добавить();
			НоваяЗапись.Период			= РеквизитыДокумента.Дата;
			НоваяЗапись.Регистратор		= РеквизитыДокумента.Ссылка;
			НоваяЗапись.Сотрудник		= СтрокаСертификата.Сотрудник;
			НоваяЗапись.Сертификат		= СтрокаСертификата.Сертификат;
			НоваяЗапись.ДатаПолучения	= СтрокаСертификата.ДатаПолучения;
		КонецЦикла;
		
	КонецЕсли;
	
	Движения.СертификатыСотрудников.Записывать = Истина;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ВидРевью = Справочники.ВидыОценкиСотрудников.ПервичнаяОценка Тогда
		
		ОценкаСотрудниковСервер.ОчиститьКомпетенцииСотрудниковПоИсточнику(Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции



#КонецОбласти // СлужебныеПроцедурыИФункции

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Invalid object call on client.'");
#КонецЕсли
